music_app/app/views/albums/show.html.erb

        <ul class="band-list">
        <% my_tracks = Track.where("album_id = ?", @album.id)%>
---
SELECT "tracks".* FROM "tracks" WHERE (album_id = 2)